|                      |       |
|----------------------|-------|
| **Time limit:**      | `1 s` |
| **Real time limit:** | `5 s` |
| **Memory limit:**    | `64M` |


### Problem sm03-1: asm/ints/sum

Напишите программу печатающую сумму последовательности знаковых чисел типа int (int32_t).

На вход подаётся последовательность 32-битных знаковых чисел.

Для ввода чисел используйте вызов функции `scanf("%d", &var)`, где `&var` указатель на вашу
переменную.

Функция scanf возвращает количество успешно считанных элементов или отрицательно число - ошибку.

Для вывода используйте вызов функции `printf("%d\n", var)`.

Можно считать что функция printf не возвращает ошибку.

В случае переполнения при подсчете суммы необходимо вывести "Overflow" (`printf("%s\n", "Overflow")`
\- вызов функции с двумя аргументами - указателями на соответвующие строки) и завершить программу.

Для хранения строковых констант используйте read only секции: `.section .rodata` или `.text`

Для корректного завершения программы main должен вернуть 0.

Сишная функция принимающая константную строку на самом деле принимает указатель на буффер, в котором
лежит строка.

### Examples

#### Input

    
    
    1 2 3 4 5

#### Output

    
    
    15

#### Input

    
    
    2000000000 2000000000 1

#### Output

    
    
    Overflow

